//Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).
//Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
//Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот.
//Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.
#include<iostream>
using namespace std;
int main() {
    int matrix[100][100];
    int n, m, i, j, ii, jj;
    cin >> n >> m;
    int s1, s2, s3, s4;
    s1 = s2 = s3 = s4 = 0;

    for (i = 0; i < n; i++) {
        for (j = 0; j < m; j++) {
            cin >> matrix[i][j];
        }
    }
    cin >> ii >> jj;

    for (i = 0; i < n; i++) {
        for (j = 0; j < m; j++) {
            if (i < ii && j >= jj) { // prv kvadrant
                s1 += matrix[i][j];
            }
            if (i < ii && j < jj) { // vtor kvadrant
                s2 += matrix[i][j];
            }
            if (i >= ii && j < jj) { //tret kvadrant
                s3 += matrix[i][j];
            }
            if (i >= ii && j >= jj) { //cetvrt kvadrant
                s4 += matrix[i][j];
            }
        }

    }

    cout << s1 << " " << s2 << " " << s3 << " " << s4;

    return 0;
}
